import { IFaqQA } from '@/components/faq/faq-interface';

export const resumeTemplateFaq: IFaqQA[] = [
  {
    id: 'resume-with-ai',
    q: 'ساخت رزومه با هوش مصنوعی چطوریه؟',
    a: 'شما برای نوشتن بخش خلاصه و دستاوردهای در رزومه خودتون میتونید از هوش مصنوعی استفاده کنید. این امکان به شما کمک میکنه تا بتونید رزومه ایده آل خودتون رو بسازید.',
  },
  {
    id: 'resume-examples',
    q: 'نمونه رزومه هایی که میتونم بسازم چیه؟',
    a: 'بعد از انتخاب نوع رزومه می‌تونید از طریق لینک معرفی شده در مطلب، از بین نمونه رزومه‌های خام به رایگان نمونه رزومه دانلود کنید و سپس آن را ویرایش کنید.',
  },
];