import { SectionHeading } from "@/components/heading/section-heading";

export function SectionOutro(): JSX.Element {
	return (
		<section id="cover-letter" className="scroll-mt-24">
			<SectionHeading anchor="cover-letter">کاورلتر</SectionHeading>
			<p>
				اگه تا اینجا رسیدید، شما قدم اول برای پیدا کردن یک کار رویایی رو با
				موفقیت گذروندید و خوندن این مقاله بود ولی این کافی نیست و باید دست به
				‌کار بشید و رزومه خودتون رو بنویسید. وقتی نوشتید بعدش می‌تونید برگردید به
				این قسمت و بقیه رو ادامه بدید:)
			</p>
			<p>
				مرحله بعد نوشتن کاورلتر هست. یه نامه که انگیزه شما برای اون شغل رو به
				استخدام‌کننده نشون بده تا با ترکیب رزومه آن‌چنان خواننده رو ذوق‌زده کنه که
				بخواد شما رو به مصاحبه دعوت کنه.
			</p>
			<p>
				امیدوارم بازخورد این آموزش ساخت رزومه مثبت باشه تا انگیزه‌ای باشه برای
				نوشتن بخش‌های بعدی…
			</p>

			<p>
				لازم به ذکر است که جرقه نوشتن این مقاله وقتی رخ داد که تعداد زیادی رزومه
				در گروه تلگرام TechImmigrants ارسال میشد و بخش زیادی از اون‌ها دارای
				اشکالات مشترک بود. پس سعی کردم با نگارش این مقاله یک روش استاندارد برای
				نگارش داشته باشیم.
			</p>
			<p>
				در آینده تلاش میکنم نکات و ترفندهایی رو درباره بهتر رزومه ذکر کنم یا
				همین مقاله رو آپدیت کنم. هم‌چنین فکر میکنم کاورلتر بخش مهمی از فرآیند
				اپلای هست و نباید دست کم گرفته بشه. از همین جهت یک آموزش کامل درباره
				نحوه نوشتن کاورلتر هم در آینده خواهم نوشت.
			</p>
		</section>
	);
}
