import { ITodo } from "@/components/todo/interface";

export const resumeTodoList: ITodo[] = [
	{
		item: "آیا بخش اطلاعات تماس شامل تمام اطلاعات ضروری هست؟",
	},
	{
		item: "آیا از یک ایمیل حرفه‌ای استفاده کردی؟ مثل name.family@gmail.com",
	},

	{
		item: "آیا از یک فرمت مناسب برای رزومه استفاده کردی؟",
	},
	{
		item: "آیا رزومه شما یک تا دو صفحه است؟",
	},
	{
		item: "آیا تمام بخش‌های ضروری رو تو رزومه خودت قرار دادی؟",
	},
	{
		item: "آیا فقط مرتبط‌ترین تجربیات کاری رو فهرست کردی؟",
	},
	{
		item: "آیا به‌جای مسئولیت‌ها، دستاوردهای خودت رو فهرست کردی؟",
	},
	{
		item: "آیا رزومه خودت رو به نسبت نیازهای آگهی‌های شغلی تنظیم کردی؟",
	},
	{
		item: "آیا میزان مناسبی از تجارت کاری رو ذکر کردی؟",
	},
	{
		item: "آیا تحصیلات خودت رو تو رزومه قرار دادی؟",
	},
	{
		item: "آیا مهارت‌های مناسب رو باتوجه به موقعیتی که میخوای درخواست بدی فهرست کردی؟",
	},
	{
		item: "آیا از سایر بخش‌های مهم رو به رزومه اضافه کردی؟",
	},
	{
		item: "آیا رزومه خودت رو خودت کامل خوندی؟",
	},
	{
		item: "آیا متن رزومه رو تو گرامرلی تست کردی که غلط املایی و گرامری نداشته باشه؟",
	},
	{
		item: "آیا رزومه رو دادی که چند تا از دوستانت بخونن و نظرشون رو گرفتی؟",
	},
];
