import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";

export function OptionalInfo(): JSX.Element {
	return (
		<>
			<h3 id="extras">اطلاعات اختیاری در بخش تماس رزومه</h3>
			<p>
				با اضافه کردن بخش‌های اختیاری مطمئن بشید که ارزشی به رزومه خودتون اضافه
				می‌کنید.
			</p>

			<h4 id="linkedin">آدرس پروفایل لینکدین</h4>
			<p>
				اگر یک پروفایل آپدیت دارید که میتونه ارزش رزومه شما رو بالا ببره، ایده
				خوبیه که اون رو اضافه کنید.
			</p>

			<h4 id="social">شبکه‌های اجتماعی</h4>
			<p>
				یا نمونه کارهای خودتون رو آنلاین منتشر کردید؟ مثلا برای برنامه‌نویسان این
				می‌تونه آدرس گیت‌هاب یا برای دیزاینرها میتونه دریبل یا برای نویسنده‌ها
				مدیوم باشه.
			</p>
			<Msg severity="warning">
				توجه کنید که وقتی مرتبط نیست و کمکی نمی‌کنه نیازی هم نیست که بزاریدش.
			</Msg>
			<p>
				مثلا لینک استک‌اورفلو برای برنامه‌نویسی که فعالیت جدی داره میتونه مثبت
				باشه ولی وقتی فعال نیست به چه دردی میخوره؟ لینک اینستاگرام و توییتر وقتی
				شخصی و مثلا به‌زبان فارسی هستند بدرد چی میخوره؟
			</p>

			<h4 id="website">وب‌سایت شخصی</h4>
			<p>
				اگه وب‌سایت شخصی دارید یا وبلاگی که توش درباره تخصص خودتون نوشتید، خوبه
				که اون رو به رزومه اضافه کنید. یا مثلا اگه کار گرافیکی میکنید و
				پورتفولیو دارید، خوبه که لینکش رو بزارید.
			</p>
		</>
	);
}
