import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";

export function OptionalInfo(): JSX.Element {
	return (
		<>
			<h3 id="extras">
				<a href="#extras" className="no-underline text-inherit hover:underline">
					اطلاعات اختیاری در بخش تماس رزومه
				</a>
			</h3>
			<p>
				با اضافه کردن بخش‌های اختیاری مطمئن بشید که ارزشی به رزومه خودتون اضافه
				می‌کنید.
			</p>

			<h4 id="linkedin">
				<a
					href="#linkedin"
					className="no-underline text-inherit hover:underline"
				>
					آدرس پروفایل لینکدین
				</a>
			</h4>
			<p>
				اگر یک پروفایل آپدیت دارید که می‌تونه ارزش رزومه شما رو بالا ببره، ایده
				خوبیه که اون رو اضافه کنید.
			</p>

			<h4 id="social">
				<a href="#social" className="no-underline text-inherit hover:underline">
					شبکه‌های اجتماعی
				</a>
			</h4>
			<p>
				یا نمونه کارهای خودتون رو آنلاین منتشر کردید؟ مثلا برای برنامه‌نویسان این
				می‌تونه آدرس گیت‌هاب یا برای دیزاینرها می‌تونه دریبل باشه.
			</p>
			<Msg severity="warning">
				توجه کنید که وقتی مرتبط نیست و کمکی نمی‌کنه نیازی هم نیست که بذاریدش.
			</Msg>
			<p>
				لینک شبکه‌های اجتماعی رو توی رزومه نذارید. نه اینستاگرام، نه توییتر یا
				ایکس. هیچ ارزشی اضافه نمی‌کنن. تنها لینک‌هایی که ارزش گذاشتن دارن گیت‌هاب،
				دریبل، یا یه وب‌سایت گرافیکی یا پورتفولیو مرتبط با کار شما هست. این هم
				برای رزومه فارسی صادقه هم برای انگلیسی.
			</p>

			<h4 id="website">
				<a
					href="#website"
					className="no-underline text-inherit hover:underline"
				>
					وب‌سایت شخصی
				</a>
			</h4>
			<p>
				اگه وب‌سایت شخصی دارید یا وبلاگی که توش درباره تخصص خودتون نوشتید، خوبه
				که اون رو به رزومه اضافه کنید. یا مثلا اگه کار گرافیکی می‌کنید و
				پورتفولیو دارید، خوبه که لینکش رو بذارید.
			</p>
			<p>
				وب‌سایت باید باکیفیت باشه. لینک دادن به یه سایت بی‌کیفیت یا نصفه‌نیمه یه
				امتیاز منفیه، نه مثبت. فقط وقتی لینکش رو بذارید که واقعا کار خوب شما رو
				نشون بده.
			</p>
		</>
	);
}
