import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";

export function ThingsToAvoid(): JSX.Element {
	return (
		<>
			<h3>نبایدها در بخش تماس رزومه</h3>
			<p>لطفا مطمئن بشید که این موراد رو تو رزومه خودتون قرار ندادید!</p>

			<h4>تاریخ تولد</h4>
			<p>
				استخدام‌کننده یا منابع انسانی نیازی نداره که بدونه شما چند سالتونه! سن
				برای تصمیم‌گیری مهم نیست. بدتر از اون ممکنه منجر به تبعیض بر اساس سن بشه.
				اگه واقعا شرکتی نیاز داشته باشه توی فرم به‌صورت مجزا میگیره پس اصراری به
				قرار دادنش توی رزومه نداشته باشید.
			</p>

			<h4>آدرس ایمیل غیرحرفه‌ای</h4>
			<p>
				یک ایمیل ساده با اسم و فامیلی خودتون روی یک سرویس دهنده عمومی مثل جیمیل
				داشته باشید تا از دریافت ایمیل‌ها خاطرجمع باشید مثلا{" "}
				<code>name.family@gmail.com</code> و لطفا از ایمیل‌های عجیب و غریب مثل{" "}
				<code>pirate169@mysite.com</code> استفاده نکنید.
			</p>
			<Msg severity="error">
				به‌هیچ عنوان از ایمیل کاری قبلی استفاده نکنید، به‌شدت غیرحرفه‌ای است.
			</Msg>

			<h4>تصویر</h4>
			<p>
				استخدام‌کننده برای ارزیابی رزومه شما نیازی نداره که بدونه شما چه شکلی
				هستید. پس عکس خودتون رو قرار ندید. منجر به قضاوت اولیه میشه. تو مصاحبه
				یا عکس پروفایل لینکدین میتونن بالاخره شما رو میبینن.
			</p>
			<Msg severity="warning">
				به‌طور خاص توی آمریکا و انگلیس بخاطر قوانین ضد تبعیض نباید عکس‌تون رو تو
				رزومه بزارید.
			</Msg>
			<p>
				این جزو حریم خصوصی شماست. البته که اگه مایل باشید عکس بزارید، کسی
				نمی‌تونه جلوی شما رو بگیره ولی توجه کنید شاید باعث بشه که ATS خودکار شما
				رو ریجکت کنه.
			</p>

			<h4>آدرس خونه‌تون!</h4>
			<p>
				خیلی عجیبه که آدرس دقیق خونه رو تو بعضی از رزومه‌ها میبینم. کسی قرار نیست
				برای شما نامه پست کنه که نیازی بهش داشته باشه
			</p>

			<h4>سایر اطلاعات غیرحرفه‌ای</h4>
			<p>لطفا اگه موارد زیر رو توی رزومه ذکر کردید، حذف شون کنید.</p>
			<ul>
				<li>جنسیت</li>
				<li>وضعیت سربازی</li>
				<li>وضعیت تاهل</li>
				<li>تعداد فرزندان</li>
				<li>وضعیت سلامت جسمانی</li>
			</ul>

			<p>
				خب به نظر شفاف بود. یک‌بار برای خودتون اطلاعات این بخش رو بلند بلند
				بخونید و مطمئن بشید اشتباهی رخ نداده باشه.
			</p>
		</>
	);
}
