import Image from "next/image";
import imgResumeSummaryCover from "./_img/resume-summary-cover.png";

export function SummaryIntro(): JSX.Element {
	return (
		<>
			<p>
				اگه اولین تاثیر منفی باشه، احتمالا تا آخر باقی می‌مونه و تغییرش سخت خواهد
				بود. پس بیاین فرصت رو از دست ندیم و تا میتونیم با خلاصه‌ی عالی، نظر
				بیننده رو جلب کنیم.
			</p>
			<p>
				طبق آمار، استخدام‌کننده‌ها حدود <b>۶ ثانیه</b> برای برانداز کردن هر رزومه
				وقت میزان. بله، این همه زحمت می‌کشید برای ۶ ثانیه. تنها درصورتی که نظرشون
				جلب بشه زمان بیشتری می‌ذارن. یکی از بخش‌های مهم که می‌تونه نظرشون رو جلب
				کنه بخش خلاصه رزومه یا هدف هست که در کنار بخش اطلاعات تماس قرار می‌گیره.
			</p>

			<figure>
				<Image src={imgResumeSummaryCover} alt="بخش خلاصه در رزومه" />
				<figcaption>
					موقعیت قرارگیری بخش خلاصه در رزومه رو در این تصویر می‌بینید
				</figcaption>
			</figure>
		</>
	);
}
