import Link from "next/link";
import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";

export function LayoutRules(): JSX.Element {
	return (
		<>
			<h3 id="layout">بهترین چیدمان برای رزومه چیست؟</h3>
			<p>
				اولین موردی که ریکروتر بهش توجه میکنه، چیدمان رزومه است. آیا شلخته و
				درهم برهم به‌نظر میرسه یا سازماندهی‌شده و تمیزه؟ آیا خیلی کوتاهه یا خیلی
				بلنده؟
			</p>

			<Msg severity="warning">
				آیا رزومه شما فریاد میزنه من رو بخون؟ یا خودش داره میگه برو بعدی؟
			</Msg>

			<h4 id="do-not">بایدهای طرح‌بندی و چیدمان رزومه</h4>
			<p>
				بزارید چند تا از بهترین روش‌ها در مورد چیدمان رزومه رو با هم مرور کنیم
			</p>

			<h5 id="one-page">رزومه باید چند صفحه باشه؟ یک صفحه</h5>
			<p>
				اگه واقعا باور داری که ارزش قابل توجهی ممکنه بهش اضافه بشه برو روی دو
				صفحه. مدیرهای منابع انسانی تو شرکت‌های بزرگ ماهی بیش از هزار تا رزومه
				میبینن. مطمئن باشید اون‌ها وقت ارزشمند خودشون رو صرف خوندن داستان زندگی
				شما نخواهند کرد. طبق آمار میگن ۶ ثانیه وقت دارید وگرنه رفته سراغ بعدی.
			</p>
			<p>
				<Link href="#length">چرا میگی رزومه باید یک صفحه باشه؟</Link>
			</p>

			<h5 id="same-layout">از طرح یکسان استفاده کن</h5>
			<p>
				یه سایز مشخص برای عناوین تنظیم کنید و اون رو برای همه بخش‌ها یکسان
				استفاده کنید.
			</p>

			<h5 id="white-space">فضای سفید کافی</h5>
			<p>به‌خصوص توی حاشیه‌های دور صفحه درنظر بگیرید.</p>

			<h5 id="font-family">فونت خوانا انتخاب کن</h5>
			<p>
				توصیه میشه که یک فونت رسمی و خوانا مثل Ubuntu, Roboto, Overpass انتخاب
				کنید و هرگز چیزی مثل Comic Sans رو حتی تست هم نکنید! قطعا یه فونت برای
				رزومه کافیه، شلوغش نکنید.
			</p>

			<h5 id="font-size">اندازه فونت مناسب انتخاب کن</h5>
			<p>
				به‌عنوان یک قانون کلی، سایز ۱۱ تا ۱۲ برای متن‌های عادی و سایز ۱۴ تا ۱۶
				برای عناوین.
			</p>

			<h5 id="pdf">پی‌دی‌اف و دیگر هیچ!</h5>
			<p>
				شما فقط باید نسخه پی‌دی‌اف رو استفاده کنید. ورد یا سایر فرمت‌ها برای شماست
				که بتونید ویرایش کنید. بقیه قراره فقط بخونن. پس فقط پی‌دی‌اف.
			</p>

			<h5 id="file-size">حجم پی‌دی‌اف رو پایین نگه‌دار</h5>
			<p>
				توصیه میشه به‌هیچ عنوان نذارید حجم فایل خروجی رزومه بیشتر از یک مگابایت
				بشه. اگه می‌تونید حجم رو زیر نیم مگابایت نگه دارید. اگه می‌تونید زیر ۲۰۰
				کیلوبایت. کمتر دیگه سخت میشه. عکس و فونت خاص ممکنه باعث بشه حجم غیرعادی
				بالا بره. هرچند بعضی جاها تا ۵ مگابایت هم قبول می‌کنن ولی وقتی میتونید
				سایز رو کم کنید، انجامش بدید.
			</p>

			<h5 id="file-name">نام‌گذاری فایل رزومه</h5>
			<p>
				فرض کنید ریکروتر فایل رزومه شما رو دانلود کرده و نوشته myresume.pdf
				به‌نظرتون بهتر نیست چند ثانیه وقت بزارید و اسم فایل رو اصلاح کنید؟ اسم
				خودتون، خط تیره، عبارت رزومه و اگه خواستید نسخه فایل که بدونید وقتی
				تغییر میدید کدوم آخرین نسخه است. مثلا من اینطوری نام‌گذاری کردم.‌ فراموش
				نکنید رزومه با سی‌وی فرق داره.
			</p>
			<pre>MrAdib-Resume-v123.pdf</pre>

			<h5 id="consistency">استمرار</h5>
			<p>
				لطفا با یک فرمون پیش برید. مثلا برای نوشتن تاریخ توی رزومه از یک فرمت
				ثابت استفاده کنید. نه اینکه یکبار با نقطه اعداد رو جدا کنید یکبار با
				اسلش.
			</p>
		</>
	);
}
