import Image from "next/image";
import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";
import { Pre } from "@/components/syntax-highlighter/pre";
import imgResumeExperienceCover from "./_img/resume-experience-cover.jpg";

export function ExperienceHowToList(): JSX.Element {
	return (
		<>
			<p>
				اگر فقط به همین یک بخش از رزومه مسلط بشید، میشه گفت که شما ۸۰ درصد
				رزومه‌نویسی رو بلد شدید.
			</p>
			<p>
				کلی تکنیک و روش هست که توی نوشتن تجربیات کاری باید رعایت کنید. اول بریم
				کلیات رو با هم مرور کنیم.
			</p>

			<h3>نحوه فهرست کردن تجربیات کاری در رزومه</h3>
			<Msg severity="info">
				یادتون باشه شغل یعنی کاری که براش پول گرفتید و انجام دادید.
			</Msg>

			<p>فرمت استاندارد برای تجربه کاری شامل موارد زیر است.</p>
			<ul>
				<li>عنوان شغلی / موقعیت شغلی</li>
				<li>اسم شرکت / موقعیت / توضیح</li>
				<li>بازه زمانی فعالیت</li>
				<li>دستاوردها و مسئولیت‌ها</li>
			</ul>

			<figure>
				<Image src={imgResumeExperienceCover} alt="تجربه کاری در رزومه" />
				<figcaption>خلاصه‌ای از اطلاعات مربوط به تجربه کاری در رزومه</figcaption>
			</figure>

			<h4>عنوان شغلی</h4>
			<p>
				همیشه عنوان شغلی رو اول بنویسید. وقتی استخدام‌کننده، رزومه شما رو با چشمش
				اسکن میکنه، تو یک نگاه میخواد ببینه که آیا شما تجربه کاری مرتبط دارید.
				فونت سایزش بهتره نسبت به بقیه متن‌ها بزرگ‌تر باشه و یا رنگش فرق کنه
			</p>
			<p>
				عنوان شغل‌های قبلی شما باید واضح باشه. ساده بهش نگاه کنید و هرچیزی تو
				آگهی شغلی بوده بنویسید چون برای ATS هم می‌تونه مهم باشه.
			</p>

			<h4>اسم شرکت، توضیح و موقعیت</h4>
			<p>
				بعد باید اسم کارفرما و شرکت رو بیارید و خوبه که موقعیت یعنی کشور و شهرش
				رو هم ذکر کنید. اگه شرکت معروفی نیست شاید بخواین به‌طور مختصر اون رو در
				یکی دو جمله در حد یک خط معرفی کنید. اغلب توصیه میشه محل شرکت ذکر بشه.
			</p>
			<p>
				نوع شغل رو هم می‌تونید با یک کلمه ذکر کنید که تمام وقت بوده، پاره‌وقت یا
				قراردادی و …
			</p>
			<Pre language="plaintext">Full-time, Part-time, Contract, etc.</Pre>

			<h4>بازه زمانی فعالیت</h4>
			<p>
				بازه زمانی استخدام شما در شرکت. یعنی سال و ماه ورود و خروج از شرکت. برای
				آخرین شغل بجای تاریخ می‌تونید عبارت present رو بنویسید یعنی تا همین الان.
			</p>
			<p>
				فرمت استاندارد تاریخ توی رزومه <code>mm/yyyy</code> هست. یعنی مثلا برای
				ماه سوم ۲۰۱۷ اینطوری مینویسین. <code>03/2017</code>
			</p>
			<p>
				به زمان‌های هر شغل دقت کنید. مثلا در حالت عادی منطقی نیست که دو شغل تمام
				وقت همزمان داشته باشید.
			</p>
			<p>
				توصیه میشه که زمان فعالیت در اون شغل رو هم بنویسید که نیازی به حساب و
				کتاب اختلاف دوتا تاریخ نباشه. مثلا
			</p>
			<Pre language="plaintext">(2 years 7 months) 12/2019 - present</Pre>
			<p>
				فاصله بین دو شغل یا گپ توی رزومه، فقط درصورتی که توضیحی براش وجود نداشته
				باشه یک اخطار یا ردفلگ تو رزومه شماست. یادتون باشه وقتی منابع انسانی یه
				گپ توی رزومه میبینه بدترین سناریویی که به ذهنش میرسه رو درنظر خواهد
				گرفت. پس بهتره توضیحی خوب و صادقانه براش داشته باشید. به‌عنوان مثال
			</p>
			<Pre language="plaintext">
				July 2018 - February 2019, due to my medical situation, I had to take
				time off to fully recover and focus on my health.
			</Pre>
			<p>
				البته که شما لازم نیست کل داستان رو بگید، مخصوصا وقتی دلیل شخصی باشه.
				اما آمادگی این رو داشته باشید که به‌طور خلاصه در این باره توی مصاحبه
				توضیح بدید.
			</p>
		</>
	);
}
