import type { JSX } from "react";
export function EducationTips(): JSX.Element {
	return (
		<>
			<h3 id="edu-tips">نکاتی در رابطه با بخش تحصیلات</h3>
			<ul>
				<li>
					همیشه آخرین مدرک تحصیلی رو بالاتر قرار بدید و به‌ترتیب به عقب برگردید.
				</li>
				<li>
					اگه مدرک دانشگاهی دارید، به‌هیچ عنوان نیازی نیست به مدرک دیپلم یا
					پیش‌دانشگاهی اشاره کنید.
				</li>
				<li>
					اگه تازه فارغ‌التحصیل شدید و تجربه کاری ندارید، می‌تونیید بخش تحصیلات رو
					در ابتدای رزومه بزارید.
				</li>
			</ul>
		</>
	);
}
