/* eslint-disable react/no-unescaped-entities */

import { ArticleLayout } from '@/components/article/layout';
import { Msg } from '@/components/msg/msg';
import { separator } from '@/lib/constants/en';
import { myNameFa } from '@/lib/constants/fa';
import { readingTime } from '@/lib/reading-time';
import { pageResumeSuffix } from '@/lib/suffix';
import { type Metadata } from 'next';
import { breadcrumb } from './breadcrumb';
import coverImg from './opengraph-image.png';

const publishDate = '2024-04-18';
const publishTime = '22:07:24';
const datePublished = `${publishDate}T${publishTime}.000Z`;
const dateModified = '2024-05-12' + 'T' + '19:31:00' + '.000Z';
const articleTitle = 'رزومه باید چند صفحه باشه؟';
const articleDescription = 'درباره تعداد صفحات رزومه حرف و حدیث زیاده ولی بیاین واقع بین باشیم، ۶ ثانیه وقت دارید.';
const pageTitle = articleTitle + pageResumeSuffix;
const pageDesc = articleDescription;
const pagePath = '/fa/resume/length';
const keywords = ['رزومه کاری', 'رزومه', 'رزومه فارسی', 'رزومه انگلیسی', 'تعداد صفحات رزومه'];

export const metadata: Metadata = {
  title: pageTitle,
  description: pageDesc + separator + myNameFa,
  openGraph: {
    type: 'article',
    publishedTime: datePublished,
  },
  twitter: {
    card: 'summary_large_image',
  },
};

function PageContent(): JSX.Element {
  return (
    <section>
      <Msg severity='info'>رزومم چند صفحه باشه؟ یک صفحه.</Msg>

      <ul>
        <li>اگه زیر ۱۰ سال سابقه کار دارید که قطعا یک صفحه رزومه کافیه</li>
        <li>برای بیش از ۱۰ سال سابقه کار تاکید میشه یک صفحه رو حفظ کنید </li>
        <li>برای بیش از ۱۵ سال سابقه کار باز هم یک صفحه، نشد دیگه دو صفحه، بیشتر توصیه نمیشه</li>
      </ul>

      <p>به این فکر کنید که وقتی قرار نیست خونده بشه، برای چی باید باشه.</p>
      <Msg severity='error'>
        اگه تصمیم گرفتی رزومه دو صفحه‌ای داشته باشی،
        مطمئن بشو که صفحه دوم ارزشش رو داشته باشه.
      </Msg>
      <p>یادتون باشه که رزومه با سی‌وی متفاوت هست. یک CV میتونه دو تا سه صفحه باشه و در موارد خاص حتی تا هشت صفحه! اگه میخواین برای یک شغل اپلای کنید شما نیاز به رزومه دارید و نه CV. معمولا CV برای اهداف آکادمیک کاربرد دارد.</p>

      <h2>چطور رزومه رو در یک صفحه جا بدم؟</h2>
      <Msg severity='warning'>بزارید واقع‌بین باشیم. سخته.</Msg>
      <p>وقتی تازه‌کار هستید همه‌چیز رو سعی می‌کنید توی رزومه بزارید و بازم شاید یک صفحه نشه چون تجربه زیادی ندارید. ولی وقتی تجارت بیشتری داشته باشید و سال‌های بیشتری کار کرده باشید، ساده‌کردن پیچیده است.</p>
      <p>بزارید یک سری تکنیک با هم چک کنیم که بتونیم رزومه رو یک صفحه‌ای کنیم.</p>

      <h3>روی اطلاعات مرتبط تمرکز کنید</h3>
      <p>باید همیشه یادتون باشه که فقط اطلاعات مرتبط که توی آگهی شغلی ذکر شده و کارفرما دنبال اون هست، مهم هستند. مثلا اگر به‌عنوان مهندس نرم‌افزار اپلای می‌کنید، مهارت کارآموزش شما به‌عنوان مدیر شبکه‌های اجتماعی هیچ اهمیتی نداره. کارفرما نیازی نداره که بدونه شما از یوگا خوشتون میاد، مخصوصا اگه جا کم داشته باشید.</p>

      <h3>دستاورها بجای مسئولیت‌ها</h3>
      <p>لیست کردن مسئولیت‌ها هیچ فایده‌ای نداره، هم رزومه رو طولانی میکنه و هم کارفرما رو خسته از خوندن و به‌هیچ عنوان شما رو متمایز نمی‌کنه. همین که عنوان شغلی شما رو میخونه حدودا مشخص میشه که چه مسئولیت‌هایی داشتید. به‌جای اون روی شاخص‌هایی ملموس که دستاورد شما بوده تمرکز کنید.</p>
      <p>بجای توضیح توی تجربیات شغلی توی پاراگراف، آیتم به آیتم کنید و به‌اصطلاح بولت بزنید یعنی یه نقطه کنارش بزنید. همینطور سعی کنید که جملات مختصر و مفید باشند.</p>

      <h3>سفارشی کردن حاشیه‌ها</h3>
      <p>شما همیشه میتونید با کم کردن حاشیه‌های صفحه، فضای خالی و اضافه ایجاد کنید. بجای ۲.۵ سانت می‌تونید ۱ سانت حاشیه درنظر بگیرید تا کلی فضای خالی بدست بیارید. هم‌چنین فاصله بین آیتم‌های تجربیات یا بولت‌ها و فاصله بین بخش‌ها و ارتفاع خطوط میتونه کم‌تر بشه تا به فضای شما اضافه بشه.</p>

      <h3>فونت کوچک‌تر</h3>
      <p>سایز فونت ۱۲ برای نوشته معمولی هست اما به این معنی نیست که شما باید توی رزومه خودتون ازش پیروی کنید. می‌تونید ۱۱ یا ۱۱.۵ رو امتحان کنید تا کلی فضای خالی اضافه بشه. فقط مطمئن باشید که نیازی به زوم کردن برای خوندن رزومه نباشه.</p>

      <h3>فضای غیرضروری هدر رو حذف کنید</h3>
      <p>اطلاعات تماس یا خلاصه رزومه بعضی به‌دلیل دیزاین فضای زیادی رو اشغال می‌کنن. فضای هدر رو بهینه کنید.</p>

      <h3>تحصیلات مدرسه رو حذف کنید</h3>
      <p>مگر اینکه کارفرمای شما هم همون مدرسه رو رفته باشه وگرنه وقتی مدرک دانشگاهی دارید نیازی نیست دیپلم و پیش‌دانشگاهی رو بنویسید</p>

      <h3>موارد تکراری رو حذف کنید</h3>
      <p>اگه مسئولیت‌های مشابهی در چند شرکت داشتید، شرح شغلی رو تکرار نکنید. واقعا جالب نیست که کارفرما چندین بار یک عبارت رو ببینه.</p>

      <h3>خلاصه رزومه رو خلاصه کنید</h3>
      <p>اسمش روشه، باید خلاصه باشه. نباید که ۶ خط بنویسید و ۱۰ تا بولت بزنید. سعی کنید حداکثر تو ۳ خط جمعش کنید.</p>

      <h3>از سایت‌های ساخت رزومه استفاده کنید</h3>
      <p>شاید اینکه خودتون بخواین دیزاین رزومه رو تغییر بدین سخت باشه. سایت‌هایی که برای ساخت رزومه طراحی شدن قالب‌های آماده یک‌صفحه‌ای زیادی دارن و شما فقط کافیه محتوا رو وارد کنید تا اون خودش توی یک صفحه براتون جا بده.</p>

    </section>
  );
}

export default function Page() {

  const articleReadingTime = readingTime(<PageContent />);

  return (
    <>
      <ArticleLayout
        title={articleTitle}
        intro={articleDescription}
        urlPath={pagePath}
        keywords={keywords}
        coverImage={coverImg}
        datePublished={datePublished}
        dateModified={dateModified}
        readTimeMinutes={articleReadingTime}
        breadcrumb={breadcrumb}
        lang='fa-IR'
      >
        <PageContent />
      </ArticleLayout>
    </>
  );
}
