import type { JSX } from "react";
import { Msg } from "@/components/msg/msg";

export function LengthWhyOnePage(): JSX.Element {
	return (
		<>
			<Msg severity="info">رزومم چند صفحه باشه؟ یک صفحه.</Msg>

			<ul>
				<li>اگه زیر ۱۰ سال سابقه کار دارید که قطعا یک صفحه رزومه کافیه</li>
				<li>برای بیش از ۱۰ سال سابقه کار تاکید میشه یک صفحه رو حفظ کنید </li>
				<li>
					برای بیش از ۱۵ سال سابقه کار باز هم یک صفحه، نشد دیگه دو صفحه، بیشتر
					توصیه نمیشه
				</li>
			</ul>

			<p>به این فکر کنید که وقتی قرار نیست خونده بشه، برای چی باید باشه.</p>
			<Msg severity="error">
				اگه تصمیم گرفتی رزومه دو صفحه‌ای داشته باشی، مطمئن بشو که صفحه دوم ارزشش
				رو داشته باشه.
			</Msg>
			<p>
				یادتون باشه که رزومه با سی‌وی متفاوت هست. یک CV میتونه دو تا سه صفحه باشه
				و در موارد خاص حتی تا هشت صفحه! اگه میخواین برای یک شغل اپلای کنید شما
				نیاز به رزومه دارید و نه CV. معمولا CV برای اهداف آکادمیک کاربرد دارد.
			</p>
		</>
	);
}
