import Image from "next/image";
import Link from "next/link";
import type { JSX } from "react";
import { Accordion } from "@/components/accordion/accordion";
import { Msg } from "@/components/msg/msg";
import { Pre } from "@/components/syntax-highlighter/pre";
import imgResumeSkillsInfographic from "./_img/resume-skills-infographic.png";
import imgResumeTopSkills from "./_img/resume-top-skills.png";

export function SkillTailoring(): JSX.Element {
	return (
		<>
			<h3>مهارت‌ها را متناسب با آگهی‌ شغلی مدنظرتون تنظیم کنید</h3>
			<p>
				ممکنه شما مهارت‌هایی عالی و کمیاب داشته باشید ولی این همیشه موثر نیست.
				مثلا فرض کنید شما حسابداری بلد هستید اما میشه بگید یک برنامه‌نویس دقیقا
				چه نیازی به حسابداری داره؟
			</p>
			<p>
				مهم‌ترین نکته اینه که آگهی‌های شغلی موردنظرتون رو دنبال کنید و کلیدواژه‌های
				توی اون‌ها رو پیدا کرده و اگر در اون‌ها مهارت دارید توی رزومه خودتون ذکر
				کنید.
			</p>
			<p>
				توجه داشته باشید که این نکته میتونه موثر باشه که با چک کردن آگهی‌های شغلی
				همیشه میتونید ببینید بازار به کدوم سمت داره میره و نیاز بازار چه
				مهارت‌هایی است و توی رشد شخصی خودتون سعی کنید به اون سمت برید.
			</p>

			<h3>مهارت‌های عمومی رو فراموش نکنید</h3>
			<p>
				بعضی از مهارت‌ها مناسب طیف وسیعی از شغل‌ها هستن. برخی از سافت‌اسکیل‌ها مثل
				کارتیمی، تفکر انتقادی، رهبری و برخی از هارداسکیل‌ها مثل اکسل، پاورپوینت،
				فتوشاپ، نویسندگی و …
			</p>
			<p>
				برای هر شغلی که اپلای می‌کنید، میتونید با خیال راحت این مهارت‌ها رو ذکر
				کنید چون به‌شکلی ممکنه به شما کمک کنند.
			</p>
			<Msg severity="info">
				همیشه تو رزومه‌نویسی، اصل مرتبط بودن رو به‌خاطر داشته باشید.
			</Msg>
			<p>
				مثلا یک استخدام‌کننده که به‌دنبال مهندس نرم‌افزار می‌گرده اهمیتی به مهارت
				شما توی بازاریابی نمیده. در عین حال، سطح مهارت شما در یک زبان‌برنامه‌نویسی
				قطعا براش مهم خواهد بود.
			</p>
			<figure>
				<Image
					src={imgResumeTopSkills}
					alt="بهترین مهارت‌ها برای قراردادن در رزومه شما"
				/>
				<figcaption>بهترین مهارت‌ها برای قراردادن در رزومه شما</figcaption>
			</figure>

			<Msg severity="success">
				بخش مهارت‌ها در رزومه میتونه بهتون کمک کنه که از سد ATS رد بشید.
			</Msg>
			<p>
				<Link href="#ats">ATS</Link> بر اساس کلیدواژه است و رزومه شما باید از
				اون کلیدواژه‌ها به میزان کافی داشته باشه. اگه جاهای دیگه فرصتش نبود،
				اینجا میتونید بهش اشاره کنید.
			</p>
			<p>
				مثلا فرض کنید یک آگهی شغلی برای زبان جاوا هست و رزومه شما اصلا کلمه جاوا
				توش ذکر نشده. پس مطمئن باشید که این رزومه توسط ATS رد میشه. در واقع ۷۰
				درصد رزومه‌ها در همین مرحله از رده خارج میشن و به مرحله بعد که چک کردن
				توسط انسان هست، اصلا نمی‌رسن.
			</p>
			<p>
				حتی اگه شرکتی از ATS هم استفاده نکنه و چک کردن توسط منابع انسانی رخ بده،
				باز هم توجه کنید که بهش گفتن دنبال یه سری کلیدواژه باش که تو رزومه باشه
				و اگه داشت بفرست برای مصاحبه. پس چه برای ATS و چه برای مدیر منابع
				انسانی، مهارت‌های مناسب آگهی شغلی رو توی رزومه بنویسید.
			</p>

			<p>
				در بعضی از شغل‌ها، سافت‌اسکیل‌ها بیشتر از هارداسکیل اهمیت دارند. این روزها
				کم نیستند سازمان‌هایی که مایلند شخصیت استخدام کنند تا مهارت.
			</p>

			<Accordion title="اینفوگرافیک چه مهارت‌هایی را در رزومه قرار دهیم؟">
				<figure>
					<Image
						src={imgResumeSkillsInfographic}
						alt="چه مهارت‌هایی را در رزومه قرار دهیم؟"
					/>
					<figcaption>چه مهارت‌هایی را در رزومه قرار دهیم؟</figcaption>
				</figure>
			</Accordion>

			<h4>بیشترین درخواست سافت‌اسکیل برای عموم صنایع</h4>
			<Pre language="plaintext">
				Time management, Effective communication, Emotional intelligence,
				Conflict management, Teamwork skills, Stress management, Productivity &
				organization, Critical thinking, Attention to detail, Adaptability
			</Pre>
		</>
	);
}
