import type { JSX } from "react";
export function OptionalPublications(): JSX.Element {
	return (
		<>
			<h3 id="publications">
				<a
					href="#publications"
					className="no-underline text-inherit hover:underline"
				>
					مقالات
				</a>
			</h3>
			<p>
				آیا شما برخی اوقات برای سایت‌ها و مجلات می‌نویسید؟ یا سوابق علمی برجسته یا
				مثلا مقاله ISI دارید؟
			</p>
			<p>
				اگه اثر منتشر شده آنلاین یا مثلا مجله دانشگاهی مرتبط دارید ممکنه بخواین
				اون رو به رزومه خودتون اضافه کنید. البته یادتون نره که آدرسی برای دسترسی
				به اون اثر ذکر کنید تا استخدام‌کننده بتونه یه چک حداقلی داشته باشه.
			</p>

			<h3 id="projects">
				<a
					href="#projects"
					className="no-underline text-inherit hover:underline"
				>
					پروژه‌ها
				</a>
			</h3>
			<p>
				کار کردن روی پروژه‌های جانبی مرتبط می‌تونه اشتیاق شما رو به کارتون نشون
				بده. مثلا یک پروژه‌ی کلاس دانشگاهی یا یه تجربه کارآفرینی پاره‌وقت یا کار
				کردن روی یک مسابقه دانشگاهی یا حتی مثلا ساخت محصولات دست‌ساز و فروش
				اون‌ها! مدیران منابع انسانی کیف می‌کنند که ببینن کارمندهاشون تو اوقات
				فراغت کارهای جالبی انجام میدن.
			</p>
		</>
	);
}
