import type { JSX } from "react";
export function OptionalLanguages(): JSX.Element {
	return (
		<>
			<p>
				بخش‌هایی که پیش از این مطرح کردیم همگی الزامی بودند. اگه اون‌ها رو درست
				پیاده کرده باشید، مطمئن باشید هر شغلی که براش درخواست بدید، به‌دستش
				می‌آرید. با این حال بخش‌های زیر می‌تونن به شما کمک کنن که رزومه پربارتری
				داشته باشید.{" "}
			</p>
			<p>
				نکته مهم این هست که یادتون باشه شما ۶ ثانیه وقت دارید. پس اگه اون بخش
				ارزشش رو داره به رزومه اضافه کنید و اگه ارزشش رو نداره ازش رد بشید.
			</p>

			<h3 id="languages">
				<a
					href="#languages"
					className="no-underline text-inherit hover:underline"
				>
					زبان
				</a>
			</h3>
			<p>
				بخش زبان معمولا هیچ ارزشی اضافه نمی‌کنه. رزومه شما همین الان به یک زبان
				نوشته شده، پس فرض می‌کنن که همون زبان رو بلدید. رزومه انگلیسی یعنی
				انگلیسی بلدید. رزومه آلمانی یعنی آلمانی بلدید.
			</p>
			<p>
				نوشتن زبان مادری هیچ چیزی اضافه نمی‌کنه. فارسی روی یک رزومه انگلیسی همون
				چیزی رو می‌گه که از قبل فرض کردن. هیچ‌کس با زبان مادری شما تحت تاثیر قرار
				نمی‌گیره.
			</p>
			<p>
				پس اگه تنها چیزی که می‌خواید بنویسید زبان مادری‌تونه، کل بخش زبان رو حذف
				کنید. فقط وقتی یک زبان رو بنویسید که واقعا برای اون نقش ارزش اضافه کنه،
				یعنی یک زبان کاری اضافه‌ی واقعی. اگه شغلی آلمانی می‌خواد و شما بلدید،
				اینجا جاش هست. اون موقع هست که این بخش ارزش جاش رو داره.
			</p>
			<p>
				برای بخش زبان کافی است خیلی ساده اسم زبان رو ذکر کنید و سطح خودتون رو هم
				جلوش بنویسید.
			</p>
			<p>
				به ترتیب، زبان مادری، روان، مسلط و کافی برای تعامل در محیط کاری، متوسط و
				ساده
			</p>
			<ul dir="ltr">
				<li>Native</li>
				<li>Fluent</li>
				<li>Proficient</li>
				<li>Intermediate</li>
				<li>Basic</li>
			</ul>
			<p>
				توجه داشته باشید که شما نباید در مورد مهارت زبانی خودتون دروغ بگید. از
				کجا معلوم، شاید مصاحبه‌کننده شما به اون زبان مسلط باشه یا حتی زبان مادری
				اون شخص باشه!
			</p>

			<h3 id="volunteer">
				<a
					href="#volunteer"
					className="no-underline text-inherit hover:underline"
				>
					تجربه داوطلبانه
				</a>
			</h3>
			<p>
				اگه از اون دسته از افرادی هستید که تو اوقات فراغت خودتون به بقیه کمک
				می‌کنید و در قبال اون هیچ انتظاری ندارید، احتمالش وجود داره که شما از اون
				دسته از کارمندان باشید که بعضی چیزها براتون بیشتر از پول ارزش داره. همین
				می‌تونه این تصور رو ایجاد کنه که شما احتمالا کارمند فداکار و وفاداری
				هستید.
			</p>
			<p>
				چندین مطالعه نشون داده که با اضافه کردن بخش تجربه داوطلبانه، شانس شما
				برای استخدام بیشتر می‌شه. مخصوصا وقتی دانشجویی هستید که هیچ تجربه‌ای
				ندارید، تجربه داوطلبانه می‌تونه بهتون کمک ویژه‌ای کنه.
			</p>
		</>
	);
}
