import type { JSX } from "react";
export function OptionalPublications(): JSX.Element {
	return (
		<>
			<h3 id="publications">
				<a
					href="#publications"
					className="no-underline text-inherit hover:underline"
				>
					مقالات
				</a>
			</h3>
			<p>
				آیا شما برخی اوقات برای سایت‌ها و مجلات می‌نویسید؟ یا سوابق علمی برجسته یا
				مثلا مقاله ISI دارید؟
			</p>
			<p>
				اگه اثر منتشر شده آنلاین یا مثلا مجله دانشگاهی مرتبط دارید ممکنه بخواید
				اون رو به رزومه خودتون اضافه کنید. البته یادتون نره که آدرسی برای دسترسی
				به اون اثر ذکر کنید تا استخدام‌کننده بتونه یه چک حداقلی داشته باشه.
			</p>
			<p>
				مقالات بیشتر اوایل مسیر کاری به کارتون می‌آن، یا وقتی تجربه کمی دارید و
				می‌خواید جای خالی رزومه رو پر کنید. همین که چند سال سابقه پیدا کردید و
				ارشدتر شدید، دستاوردهای شما توی کار خیلی بیشتر از مقالاتتون اهمیت پیدا
				می‌کنن.
			</p>

			<h3 id="projects">
				<a
					href="#projects"
					className="no-underline text-inherit hover:underline"
				>
					پروژه‌ها
				</a>
			</h3>
			<p>
				کار کردن روی پروژه‌های جانبی مرتبط می‌تونه اشتیاق شما رو به کارتون نشون
				بده. مثلا یک پروژه‌ی کلاس دانشگاهی یا یه تجربه کارآفرینی پاره‌وقت یا کار
				کردن روی یک مسابقه دانشگاهی یا حتی مثلا ساخت محصولات دست‌ساز و فروش
				اون‌ها! مدیران منابع انسانی کیف می‌کنن که ببینن کارمندهاشون تو اوقات فراغت
				کارهای جالبی انجام می‌دن.
			</p>
			<p>
				بخش پروژه‌ها بیشتر برای آدم‌های تازه‌کاره، حدودا ۱ تا ۲ سال تجربه. اگه همین
				الان یه جایی کار می‌کنید، دستاوردهای شما توی همون شغل جالب‌تر از هر پروژه
				جانبیه. یه پروژه جانبی خیلی بزرگ که موقع کار تمام‌وقت ساختید حتی می‌تونه
				مثل یه هشدار به‌نظر بیاد. کِی وقتش رو داشتید؟
			</p>
			<p>
				مشارکت در متن‌باز فرق داره. این‌ها همیشه ارزشمندن. معمولا توی اوقات فراغت
				روشون کار می‌کنید و نشون می‌دن که واقعا با کارتون درگیر و علاقه‌مندید.
			</p>
		</>
	);
}
