import type { JSX } from "react";
export function OptionalLanguages(): JSX.Element {
	return (
		<>
			<p>
				بخش‌هایی که پیش از این مطرح کردیم همگی الزامی بودند. اگه اون‌ها رو درست
				پیاده کرده باشید، مطمئن باشید برای هر شغلی که درخواست بدید اون رو بدست
				خواهید آورد. با این حال بخش‌های زیر می‌تونه به شما کمک کنه که رزومه
				پربارتری داشته باشید.{" "}
			</p>
			<p>
				نکته مهم این هست که یادتون باشه شما ۶ ثانیه وقت دارید. پس اگه اون بخش
				ارزشش رو داره به رزومه اضافه کنید و اگه ارزشش رو نداره ازش رد بشید.
			</p>

			<h3 id="languages">زبان</h3>
			<p>
				آیا دو زبانه هستید؟ یا حتی بهتر! چند زبانه هستید؟ خوبه که بخش زبان رو به
				رزومه خودتون اضافه کنید.
			</p>
			<p>
				هرچند در این مورد خاص ما فارسی‌زبان‌ها، زبان فارسی رو که بلدیم و معمولا
				برای شغل‌های بین‌المللی، زبان انگلیسی رو باید روان صحبت کنیم. پس همه ما،
				حداقل دو زبان رو میدونیم. اگر شغلی نیاز به زبان خاص، مثلا آلمانی داشته
				باشه و شما هم بلد باشید، طبیعیه که ذکر کردنش در این بخش الزامی میشه و
				بحثی توش نیست. اما زمانی که شغل به انگلیسی هست و رزومه هم به انگلیسی،
				زبان فارسی چه کمکی میتونه بکنه؟ چه ارزشی به رزومه شما اضافه میکنه؟ اگه
				به‌نظرتون مهم نیست میتونید این بخش رو حذف کنید.
			</p>
			<p>
				توجه کنید که مثلا اگر ترکی یا همون زبان آذربایجانی Azerbaijani بلد
				هستید، پس شما سه‌زبانه‌اید و به‌نظرم حالا شرایط فرق کرده و بهتره این بخش رو
				بزارید.
			</p>
			<p>
				برای بخش زبان کافی است خیلی ساده اسم زبان رو ذکر کنید و سطح خودتون رو
				درباره اون زبان هم جلوش بنویسید.
			</p>
			<p>
				به ترتیب، زبان مادری، روان، مسلط و کافی برای تعامل در محیط کاری، متوسط و
				ساده
			</p>
			<ul dir="ltr">
				<li>Native</li>
				<li>Fluent</li>
				<li>Proficient</li>
				<li>Intermediate</li>
				<li>Basic</li>
			</ul>
			<p>
				توجه داشته باشید که شما نباید در مورد مهارت زبانی خودتون دروغ بگید. شما
				هیچ‌وقت نمی‌دونید، شاید مصاحبه‌کننده شما به اون زبان مسلط باشه یا حتی زبان
				مادری اون شخص باشه!
			</p>

			<h3 id="volunteer">تجربه داوطلبانه</h3>
			<p>
				اگه از اون دسته از افرادی هستید که تو اوقات فراغت خودتون به بقیه کمک
				می‌کنید و درقبال اون هیچ انتظاری ندارید، احتمالش وجود داره که شما از اون
				دسته از کارمندان هستید که بعضی چیزها براتون بیشتر از پول ارزش داره.
				می‌تونه این تصور رو ایجاد کنه که شما احتمالا کارمند فداکار و وفاداری
				هستید.
			</p>
			<p>
				چندین مطالعه نشون داده که با اضافه کردن بخش تجارت داوطبانه، شانس شما
				برای استخدام بیشتر میشه. مخصوصا وقتی دانشجویی هستید که هیچ تجربه‌ای
				ندارید، تجربه داوطلبانه میتونه بهتون کمک ویژه‌ای کنه.
			</p>
		</>
	);
}
